Revit 2016 API
FabricationConfiguration.GetMaterialGroup Method
 Gets material group from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public string GetMaterialGroup(
	int matId
)
Visual Basic
Public Function GetMaterialGroup ( _
	matId As Integer _
) As String
Visual C++
public:
String^ GetMaterialGroup(
	int matId
)
Parameters
matId
Type: System.Int32
 The material identifier.
Return Value
 The material group.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace